tests/load_tests/hey/delete_hey_200_requests.txt
hey -m DELETE 'http://localhost:8080/v1/airports?airportId=4'

Summary:
  Total:        1.2397 secs
  Slowest:      0.6159 secs
  Fastest:      0.0055 secs
  Average:      0.2528 secs
  Requests/sec: 161.3244
  
  Total data:   3400 bytes
  Size/request: 17 bytes

Response time histogram:
  0.006 [1]     |■
  0.067 [14]    |■■■■■■■■■■■■■■■■■
  0.128 [24]    |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.189 [31]    |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.250 [27]    |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.311 [33]    |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.372 [31]    |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.433 [21]    |■■■■■■■■■■■■■■■■■■■■■■■■■
  0.494 [14]    |■■■■■■■■■■■■■■■■■
  0.555 [2]     |■■
  0.616 [2]     |■■


Latency distribution:
  10% in 0.0786 secs
  25% in 0.1471 secs
  50% in 0.2559 secs
  75% in 0.3566 secs
  90% in 0.4257 secs
  95% in 0.4462 secs
  99% in 0.5778 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0091 secs, 0.0055 secs, 0.6159 secs
  DNS-lookup:   0.0059 secs, 0.0000 secs, 0.0259 secs
  req write:    0.0002 secs, 0.0000 secs, 0.0031 secs
  resp wait:    0.2430 secs, 0.0053 secs, 0.5510 secs
  resp read:    0.0002 secs, 0.0000 secs, 0.0195 secs

Status code distribution:
  [200] 200 responses