tests/load_tests/hey/post_hey_200_requests.txt
hey -m POST -d '{ "name": "PGN", "location": "Perpignan" }' 'http://localhost:8080/v1/airports/'

Summary:
  Total:        0.0951 secs
  Slowest:      0.0584 secs
  Fastest:      0.0021 secs
  Average:      0.0193 secs
  Requests/sec: 2103.8593
  
  Total data:   11400 bytes
  Size/request: 57 bytes

Response time histogram:
  0.002 [1]     |■
  0.008 [38]    |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [51]    |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [26]    |■■■■■■■■■■■■■■■■■■■■
  0.025 [18]    |■■■■■■■■■■■■■■
  0.030 [23]    |■■■■■■■■■■■■■■■■■■
  0.036 [20]    |■■■■■■■■■■■■■■■■
  0.042 [8]     |■■■■■■
  0.047 [11]    |■■■■■■■■■
  0.053 [1]     |■
  0.058 [3]     |■■


Latency distribution:
  10% in 0.0058 secs
  25% in 0.0091 secs
  50% in 0.0145 secs
  75% in 0.0294 secs
  90% in 0.0390 secs
  95% in 0.0443 secs
  99% in 0.0575 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0032 secs, 0.0021 secs, 0.0584 secs
  DNS-lookup:   0.0036 secs, 0.0000 secs, 0.0289 secs
  req write:    0.0003 secs, 0.0000 secs, 0.0055 secs
  resp wait:    0.0135 secs, 0.0020 secs, 0.0366 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0024 secs

Status code distribution:
  [501] 200 responses